CSI API ETABS v1
cDesignStrip.GetDesignStrip Method
 Retrieves the specified Design Strip
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDesignStrip(
	string Name,
	ref string[] Point,
	ref double[] GlobalX,
	ref double[] GlobalY,
	ref double[] GlobalZ,
	ref double[] WBLeft,
	ref double[] WBRight,
	ref double[] WALeft,
	ref double[] WARight,
	ref bool[] AutoWiden
)
Function GetDesignStrip (
	Name As String,
	ByRef Point As String(),
	ByRef GlobalX As Double(),
	ByRef GlobalY As Double(),
	ByRef GlobalZ As Double(),
	ByRef WBLeft As Double(),
	ByRef WBRight As Double(),
	ByRef WALeft As Double(),
	ByRef WARight As Double(),
	ByRef AutoWiden As Boolean()
) As Integer
Dim instance As cDesignStrip
Dim Name As String
Dim Point As String()
Dim GlobalX As Double()
Dim GlobalY As Double()
Dim GlobalZ As Double()
Dim WBLeft As Double()
Dim WBRight As Double()
Dim WALeft As Double()
Dim WARight As Double()
Dim AutoWiden As Boolean()
Dim returnValue As Integer
returnValue = instance.GetDesignStrip(Name,
	Point, GlobalX, GlobalY, GlobalZ,
	WBLeft, WBRight, WALeft, WARight,
	AutoWiden)
int GetDesignStrip(
	String^ Name,
	array<String^>^% Point,
	array<double>^% GlobalX,
	array<double>^% GlobalY,
	array<double>^% GlobalZ,
	array<double>^% WBLeft,
	array<double>^% WBRight,
	array<double>^% WALeft,
	array<double>^% WARight,
	array<bool>^% AutoWiden
)
abstract GetDesignStrip :
        Name : string *
        Point : string[] byref *
        GlobalX : float[] byref *
        GlobalY : float[] byref *
        GlobalZ : float[] byref *
        WBLeft : float[] byref *
        WBRight : float[] byref *
        WALeft : float[] byref *
        WARight : float[] byref *
        AutoWiden : bool[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing Design Strip
Point
Type: System.String[]
 The unique name of a point object along the polyline that defines the strip.
GlobalX
Type: System.Double[]
 The global X coordinate of the specified point object.
GlobalY
Type: System.Double[]
 The global Y coordinate of the specified point object.
GlobalZ
Type: System.Double[]
 The global Z coordinate of the specified point object.
WBLeft
Type: System.Double[]
 The strip width left just before the specified point.
WBRight
Type: System.Double[]
 The strip width right just before the specified point.
WALeft
Type: System.Double[]
 The strip width left just after the specified point.
WARight
Type: System.Double[]
 The strip width right just after the specified point.
AutoWiden
Type: System.Boolean[]
 This is boolean indicating whether the Strip Width Option is set to Auto Widen Entire Strip (True), or User Specified Strip Segment Width (False)
Return Value
Type: Int32
 Returns zero if the Design Strip is successfully retrieved, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Point as String()
   Dim GlobalX as Double()
   Dim GlobalY as Double()
   Dim GlobalZ as Double()
   Dim WBLeft as Double()
   Dim WBRight as Double()
   Dim WALeft as Double()
   Dim WARight as Double()
   Dim AutoWiden as Boolean()
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new Design Strip with name "MyDesignStrip1A" ; currently not available in API
'get DesignStrip
    ret = SapModel.DesignConcreteSlab.DesignStrip.GetDesignStrip("MyDesignStrip1A", Point, GlobalX, GlobalY, GlobalZ, WBLeft, WBRight, WALeft, WARight, AutoWiden)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDesignStrip Interface
ETABSv1 Namespace